{
  "08-07-2023": {
    "Added": {
      "New command: /suggest <suggestion>": "This command allows users to suggest new features for the bot. If you want to suggest a new command or a new feature for the bot, you can use this command to suggest it.",
      "New command: /alias <alias> <user>": "This command allows users to create aliases for themselves or their friends. For example, if you have a friend who you want to use a command on but their name is difficult to pronounce clearly you can create aliases so that the bot recognizes that you are trying to say their name.",
      "New voice command: 'message chat <message>'": "This command allows users to send a message to the chat. If you want to send a message to the chat but you don't want to type it out, you can use this command to send a message to the chat.",
      "New voice command: 'list aliases <user>": "This command allows users to list all of the aliases that have been created for a user."
    },
    "In progress": {
      "New command: /listaliases <user>": "This command will allow users to list all of the aliases that have been created for a user.",
      "Auto generating more aliases": "Currently the aliases are automatically generated for the username and the nickname of the user. However, the display name is not recognized by the bot. I am working on a way to automatically generate aliases for the display name as well."
    }
  },
  "08-08-2023": {
    "Added": {
      "New command /listaliases <user>": "This command allows users to list all of the aliases that have been created for a user.",
      "New command /generateinvite <server-id>": "Generate an invite using the id of a server that Spinny Bot is in. See all of the servers that Spinny Bot is in by using the command /serverlist"
    },
    "Changed": {
      "Reworked 'mods crush <user>s skull' voice command": "The command now has better name recognition so it will be easier to use.",
      "Edited voice commands to recognize commands anywhere in the sentence": "Previously, the voice commands would only work if the command was the first word in the sentence. Now, the voice commands will work anywhere in the sentence."
    },
    "In progress": {
      "New command: /addvoicecommand <command> <response>": "This command will allow users to add new voice commands to the bot by providing mp3 files.",
      "Updating custom voice command handling": "The bot will be updated to handle custom voice commands better (Nothing will really change on the user's end)."
    }
  }
}
